#벡터(vector)

#참조 : 첨자(index)는 1부터 시작

v <- c(1,3,5,7,9)

v[1]
v[2]
v[3]
v[4]
v[5]

v[0]    # numeric(0)

vt1 <- v[1]+v[2]+v[3]+v[4]+v[5]
vt2 <- sum(v)

#길이 : 벡터의 길이
vl <- length(v)
vl

#평균 
va <- sum(v)/length(v)
va

#맨 마지막 요소의 값
ve <- v[vl]
ve

#슬라이스
v[1:vl]
v[2:4]
v[3:vl]

#상대참조
rc <- c(2:4)
rc
v[rc]

##
v10 <- c('a','b','c','d','e','f','g','h','i','j')

v10[c(2,4,6)]
v10[c(2,4,6,8:10)]

v10[seq(1,length(v10),2)]   #홀수번째 "a" "c" "e" "g" "i"
v10[seq(2,length(v10),2)]   #짝수번째 "b" "d" "f" "h" "j" 

#음수 :제외
v10[-11]    # "a" "b" "c" "d" "e" "f" "g" "h" "i" "j"  (11번째 제외)
v10[-1]     # "b" "c" "d" "e" "f" "g" "h" "i" "j"  (1번째 제외)
v10[c(-1,-3,-5)]  # (1,3,5 번째 제외)

#원본을 변경시키려면 다시 원본 변수에 할당해야함
#마지막 요소를 삭제
v10 <- v10[-length(v10)]
v10       #  "a" "b" "c" "d" "e" "f" "g" "h" "i" (마지막 요소 제외됨)
